const dayChart=(data) => {return {
    labels: ['0h', '1h', '2h', '3h', '4h', '5h', "6h", "7h", "8h", "9h", "10h", "11h", "12h", "13h", "14h", "15h", "16h", "17h", "18h", "19h", "20h", "21h", "22h", "23h"],
    datasets:[
      {
        label:'Tổng Doanh Thu',
        data:data,
        borderColor:"darkorange",
        fill:"white",
        pointBackgroundColor:[
            'rgba(255, 99, 132, 0.6)',
            'rgba(229, 241, 75, 0.6)',
            'rgba(56, 89, 236, 0.6)',
            'rgba(75, 192, 192, 0.6)',
            'rgba(247, 52, 52, 0.6)',
            'rgba(113, 220, 95, 0.6)',
            'rgba(255, 99, 132, 0.6)',
            'rgba(150, 100, 53, 0.6)',
            'rgba(209, 45, 123, 0.6)',
            'rgba(184, 200, 100, 0.6)',
            'rgba(168, 178, 219, 0.6)',
            'rgba(198, 25, 90, 0.6)',
            'rgba(250, 0, 0, 0.6)',
            'rgba(255, 99, 132, 0.6)',
            'rgba(229, 241, 75, 0.6)',
            'rgba(56, 89, 236, 0.6)',
            'rgba(75, 192, 192, 0.6)',
            'rgba(247, 52, 52, 0.6)',
            'rgba(113, 220, 95, 0.6)',
            'rgba(255, 99, 132, 0.6)',
            'rgba(150, 100, 53, 0.6)',
            'rgba(209, 45, 123, 0.6)',
            'rgba(184, 200, 100, 0.6)',
            'rgba(168, 178, 219, 0.6)',
            'rgba(198, 25, 90, 0.6)',
            'rgba(250, 0, 0, 0.6)'
        ],
        pointRadius: 5
      }
    ]
  }
}
export default dayChart